---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData
source: html/c9e02db0-92a5-f7e4-a717-9eb3cca40f9c.htm
---
# AnalyticalTransferSwitchData Properties

The current rating value of the electrical analytical transfer switch.